Repository: airani/wp-auto-upload
Catalog: src/lang/auto-upload-images-*.po
Languages: fa_ir, fr_fr, ko_kr

source: Auto Upload Images Settings
fa_ir: تنظیمات بارگذاری خودکار تصاویر
fr_fr: Réglages du rapatriement des images
ko_kr: 자동 업로드 이미지 설정

source: Auto Upload Images
fa_ir: بارگذاری خودکار تصاویر
fr_fr: Rapatrier les images
ko_kr: 자동 업로드 이미지

source: Settings Saved.
fa_ir: تنظیمات ذخیره شد.
fr_fr: Réglages sauvegardés.
ko_kr: 설정 저장됨.

source: Successfully settings reset to defaults.
fa_ir: تنظیمات با موفقیت به حالت پیش‌فرض تغییر یافت.

source: Base URL:
fa_ir: آدرس اصلی:
fr_fr: URL de base :
ko_kr: 기본 URL:

source: If you need to choose a new base URL for the images that will be automatically uploaded. Ex:
fa_ir: در صورت نیاز آدرس اصلی جدیدی برای تصاویری که به صورت خودکار بارگذاری می‌شوند انتخاب کنید. مثل:
fr_fr: Si vous voulez choisir une URL de base différente pour les images rapatriées. Ex :
ko_kr: 자동으로 업로드할 영상에 대해 새 기본 URL을 선택해야 하는 경우. Ex:

source: Image Name:
fa_ir: نام تصویر:
fr_fr: Nom de l'image :
ko_kr: 이미지 명:

source: Choose a custom filename for the new images will be uploaded. You can also use these shortcodes %s.
fa_ir: نام دلخواهی برای نام فایل تصاویر جدیدی که بارگذاری می‌شود انتخاب کنید. همچنین می‌توانید از کدهای کوتاه %s در این نام استفاده کنید.
fr_fr: Personnalisez le nom de fichier des images rapatriées. Vous pouvez utiliser les shortcodes %s.
ko_kr: 새 이미지를 업로드할 사용자 지정 파일 이름을 선택합니다. 이러한 단축 코드(%s)도 사용할 수 있습니다.

source: Alt Name:
fa_ir: نام alt تصویر:
fr_fr: Balise alt :
ko_kr: 대체명:

source: Choose a custom alt name for the new images will be uploaded. You can also use these shortcodes %s.
fa_ir: نام دلخواهی برای نام alt تصاویر جدیدی که بارگذاری می‌شود انتخاب کنید. همچنین می‌توانید از کدهای کوتاه %s در این نام استفاده کنید.
fr_fr: Personnalisez la balise alt des images rapatriées. Vous pouvez utiliser les shortcodes %s.
ko_kr: 새 영상이 업로드될 사용자 지정 대체명을 선택합니다. 이러한 단축 코드(%s)도 사용할 수 있습니다.

source: Image Size:
fa_ir: اندازه تصویر:
fr_fr: Taille de l'image :
ko_kr: 이미지 크기:

source: (Inactive)
fa_ir: (غیرفعال)

source: Max Width
fa_ir: بیشترین عرض
fr_fr: Largeur maximale
ko_kr: 최고 넓이

source: Max Height
fa_ir: بیشترین ارتفاع
fr_fr: Hauteur maximale
ko_kr: 최고 높이

source: You can choose max width and height for images uploaded by this plugin on your site. If you leave empty each one of fields by default use the original size of the image.
fa_ir: شما می‌توانید بیشترین عرض و ارتفاع تصاویری که با استفاده از این افزونه در سایت بارگذاری می‌شوند را از این قسمت تعیین نمایید. همچنین در صورت خالی رها کردن هر یک از این گزینه‌ها به صورت پیش‌فرض از اندازه های اصلی تصویر استفاده می‌گردد.
fr_fr: Vous pouvez régler une hauteur et une largeur maximale pour les images rapatriées. Si vous laissez ces champs vides, le plugin utilisera la taille originelle de l'image.
ko_kr: 사이트에서 이 플러그 인으로 업로드한 이미지의 최대 너비와 높이를 선택할 수 있습니다. 기본적으로 각 필드를 비워 두는 경우 영상의 원래 크기를 사용하십시오.

source: To activate this feature please enable Gd or Imagick extensions of PHP.
fa_ir: برای فعال سازی این امکان لطفا افزونه های Gd یا Imagick را برای PHP نصب و فعال نمائید.

source: Exclude Post Types:
fa_ir: نوع مطلب های مثتثنی:
fr_fr: Exclure ces types de Posts:
ko_kr: 게시 유형 제외:

source: Select the Post Types that you want exclude from automatic uploading
fa_ir: نوع مطالبی که می‌خواهید بارگذاری خودکار تصاویر در آنها انجام نشود را انتخاب کنید.
fr_fr: Sélectionnez les types de Posts que vous voulez exclure du rapatriement
ko_kr: 자동 업로드에서 제외할 게시 유형 선택

source: Exclude Domains:
fa_ir: دامنه‌های مثتثنی:
fr_fr: Exclure les domaines :
ko_kr: 도메인 제외:

source: Enter the domains you wish to be excluded from uploading images: (One domain per line)
fa_ir: دامنه‌هایی را که می‌خواهید از آنها آپلود تصاویر انجام نگردد وارد نمایید: (هر خط یک آدرس)
fr_fr: Vous pouvez interdire le rapatriement des images de ces domaines : (un domaine par ligne)
ko_kr: 업로드에서 제외할 도메인 입력:(한줄에 하나의 도메인)

source: Reset Options
fa_ir: بازگردانی تنظیمات اصلی

source: Are you sure to reset all options to defaults?
fa_ir: آیا از تغییر تمام تنظیمات این افزونه به حالت پیش‌فرض اطمینان دارید؟

source: Information
fa_ir: اطلاعات
ko_kr: 정보

source: Report Bug and Issues
fa_ir: گزارش مشکل و درخواست بهبود
fr_fr: Signaler un problème
ko_kr: 버그 보고와 이슈

source: Github Repository
fa_ir: مخزن گیت‌هاب
fr_fr: Dépôt Github
ko_kr: Github 저장소

source: Plugin Page in WP
fa_ir: صفحه افزونه در سایت وردپرس
fr_fr: Page du plugin sur WordPress
ko_kr: WP의 플러그 인 페이지

source: Rate to this plugin
fa_ir: به این افزونه امتیاز دهید
fr_fr: Noter ce plugin
ko_kr: 이 플러그인 평가

source: Twitter of Plugin Developer
fa_ir: توییتر توسعه‌دهنده افزونه
fr_fr: Twitter du développeur de ce plugin
ko_kr: 플러그인 개발자 트윗

source: Official Page
fa_ir: صفحه رسمی افزونه
fr_fr: Page officielle
ko_kr: 공식 페이지

source: If you are a wp developer and like to contribute to this plugin development or you are a translator and want to have this plugin in your language you can start from <a href="https://github.com/airani/wp-auto-upload" target="_blank">plugin Github repository</a>.
fa_ir: اگر شما یک توسعه‌دهنده وردپرس هستید و تمایل دارید تا در توسعه این افزونه مشارکت داشته باشید و یا یک مترجم هستید و می‌خواهید زبان مورد نظر خود را به افزونه اضافه کنید همین حالا می‌توانید از <a href="https://github.com/airani/wp-auto-upload" target="_blank">مخزن افزونه در گیت‌هاب</a> شروع کنید.
fr_fr: Si vous êtes développeur et que vous souhaitez contribuer à l'amélioration du plugin, ou que vous voulez traduire ce plugin dans votre langue, vous pouvez démarrer sur <a href="https://github.com/airani/wp-auto-upload" target="_blank">le dépot de ce plugin sur Github</a>.
ko_kr: 당신이 WP 개발자이고 이 플러그인 개발에 기여하고 싶거나 이 플러그 인을 변환기로 사용하고 싶은 경우 <a href="https://github.com/airani/wp-auto-upload" target="_blank">플러그인 Github 저장소</a> 에서 시작 할 수 있습니다.
